## Missing Data

Let's see in brief how to deal with Missing Data in pandas

In [1]:
import numpy as np
import pandas as pd

In [2]:
df1 = pd.DataFrame({'C1':[11,21,np.nan],
                  'C2':[15,np.nan,np.nan],
                  'C3':[10,20,30]})

In [3]:
df1

     C1    C2  C3
0  11.0  15.0  10
1  21.0   NaN  20
2   NaN   NaN  30

In [4]:
df1.isna()

      C1     C2     C3
0  False  False  False
1  False   True  False
2   True   True  False

In [6]:
df1.isna().sum() # column wise

C1    1
C2    2
C3    0
dtype: int64

In [6]:
df1.dropna()

     C1    C2  C3
0  11.0  15.0  10

In [9]:
df1.fillna(value='DEFAULT')

        C1       C2  C3
0       11       15  10
1       21  DEFAULT  20
2  DEFAULT  DEFAULT  30

In [8]:
df1.fillna(df1.mean())

     C1    C2  C3
0  11.0  15.0  10
1  21.0  15.0  20
2  16.0  15.0  30

In [10]:
df1['C1'].fillna(value=df1['C1'].mean()) #filling with mean of particular column

0    11.0
1    21.0
2    16.0
Name: C1, dtype: float64